{
  "title": "Bubble Fest - EDM Festival & Ticketing System",
  "author": "Mohamed Yassine Hemissi",
  "categories": ["Academic/Community", "Entrepreneurship"],
  "post_date": "2022-06-13",

  "update_date": "2023-06-13",
  "slug": "bubble-fest-edm-festival",
  "description": "Bubble Fest was the first EDM festival in Tunisia. I served as one of the organizers, handling the technical aspects including ticketing, event advertising, and access validation systems.",
  "technologies": ["Web Development", "Algorithms", "Event Tech"],
  "year": "2022",
  "github": "",
  "demo": "https://bubblefest-v2.vercel.app/",
  "content": "Bubble Fest was the first EDM festival ever held in Tunisia. I served as one of the organizers, focusing on the technical and technological aspects of the event. My responsibilities included designing a platform for ticket purchases, managing event advertising, and developing the algorithm for ticket purchase uniqueness.\n\nSince there was no online purchase option and tickets were only sold hand-to-hand through agents, I implemented a system that generated a random key upon ticket purchase. This key was then sent to the purchaser's email, and agents used it to validate the purchase. On the day of the event, the system validated passes and drink packs for entry.\n\nWe had prepared plans for a second edition of Bubble Fest, including a dedicated website and a podcast program, but the project was eventually discontinued when the founders decided to pursue other opportunities. This experience gave me practical insight into event technology, ticketing systems, and organizing large-scale musical events in a pioneering context.\n\n## What I Built\n\nI created a system where every ticket purchase generated a unique random key that got sent to the buyer's email. Agents could reference this key to prevent accidental duplicates, and on the day of the festival, we validated these keys at the gates to let people in and redeem their drink packs.\n\nThe validation logic checked that keys were legitimate, hadn't been used multiple times, and were still valid. Pretty straightforward but it had to work reliably when hundreds of people were trying to get in.\n\n## Website & Branding\n\n![Bubble Fest Original Website Landing](https://portfoliomyh.b-cdn.net/bubblefest/chrome_yfMOHsHiDu.png)\n\n![Bubble Fest Landing Variation](https://portfoliomyh.b-cdn.net/bubblefest/QIVjkh5jfo.png)\n\n![Bubble Fest 2nd Edition Website](https://portfoliomyh.b-cdn.net/bubblefest/tWgiSLKZkP.png)\n\n![Bubble Fest Podcast & Extended Platform](https://portfoliomyh.b-cdn.net/bubblefest/6v5b6jZ2TU.png)\n\n## Email Examples\n\n![Ticket Purchase Email with Validation Key](https://portfoliomyh.b-cdn.net/bubblefest/chrome_bWSYeyM4PM.png)\n![Ticket Confirmation](https://portfoliomyh.b-cdn.net/bubblefest/bubbleticket.PNG)\n\n## Conclusion\n\n It was a cool project though—learned a lot about building systems that actually need to work under pressure, and it was pretty special being part of Tunisia's first real electronic music festival and I used the technology I built in other events noting for example Next Music that was the biggest event that took place at the Uthina Amphitheater in 2022. alongside with tunisian startups that offer the same like Ija and Teskerti."
}
